[{"title": "How carrier incentives allow iPhones to be more affordable", "summary": "Investing.com -- Bank of America said in a note this week that aggressive carrier incentives can make iPhones more accessible, despite higher base prices for Apple’s latest models.", "description": "", "url": "https://finance.yahoo.com/news/carrier-incentives-allow-iphones-more-103002357.html"}, {"title": "Magnificent Seven surpass EU GDP: Is this a tech bubble warning?", "summary": "The combined market value of the US 'Magnificent Seven' tech giants has surpassed the EU’s GDP, raising concerns of a tech bubble. While valuations are high, comparisons to the dot-com era suggest this may be a structural shift.View on euronews", "description": "", "url": "https://www.euronews.com/business/2025/10/04/magnificent-seven-surpass-eu-gdp-is-this-a-tech-bubble-warning?utm_source=yahoo&utm_campaign=feeds_business_articles_2024&utm_medium=referral"}, {"title": "'We threw phone cases from a 250-metre-high dam to show that our products work'", "summary": "Mous co-founder James Griffith embraced publicity stunts to help turn the phone case brand into a £30m success story.", "description": "", "url": "https://uk.finance.yahoo.com/news/mous-phone-cases-entrepreneur-london-050046379.html"}, {"title": "Stocks to Watch Recap: Apple, Applied Materials, Chevron, Broadcom", "summary": "↗️ Apple (AAPL): Shares in the tech giant are trading near their all-time high from last December. Strong demand for new iPhone 17s have pushed Apple stock higher in recent weeks. The shares rose 0.3% Friday.", "description": "", "url": "https://www.wsj.com/livecoverage/stock-market-today-government-shutdown-10-03-2025/card/stocks-to-watch-friday-applied-materials-chevron--cQ5ipWfTpvCdfEQLcC3C?siteid=yhoof2&yptr=yahoo"}, {"title": "These Stocks Moved the Most Today: Tesla, Applied Materials, Apple, Plug Power, Wynn Resorts, Rumble, and More", "summary": "Stocks were mostly higher Friday as investors continued to shrug off the government shutdown.  Tesla  declined 1.4%, extending losses from Thursday’s session when it fell 5.1% after it reported third-quarter deliveries of 497,099 cars, a record for any quarter.  Tesla stock has gained 4.3% this year.", "description": "", "url": "https://www.barrons.com/articles/stock-movers-a531f4ec?siteid=yhoof2&yptr=yahoo"}, {"title": "AMD not fabbing at Intel, says SemiAccurate; shares retreat", "summary": "Shares of Advanced Micro Devices Inc (NASDAQ:AMD) fell 2.9% on Friday and Intel Corporation (NASDAQ:INTC) slipped 1.1% late Friday, paring some midweek gains fueled by reports of a potential manufacturing deal between the two rivals. The pullback came as SemiAccurate published a blunt rebuttal of the rumors, stating there is no agreement and dismissing the speculation as baseless.", "description": "", "url": "https://finance.yahoo.com/news/amd-not-fabbing-intel-says-202247952.html"}, {"title": "Tech Industry Groups Push Back on Trump’s $100,000 H-1B Visa Fee", "summary": "A coalition of tech industry groups sent a letter to President Trump urging him to reconsider a new $100,000 fee for H-1B holders, arguing that the policy shift would hurt the U.S. in the artificial-intelligence race.  The new fee is testing the relationship between the tech industry and the White House after many executives have increased their U.S. spending and appealed to Trump.", "description": "", "url": "https://www.wsj.com/livecoverage/stock-market-today-government-shutdown-10-03-2025/card/tech-industry-groups-push-back-on-trump-s-100-000-h-1b-visa-fee-UDqN2riqn00Dg2xnG2X3?siteid=yhoof2&yptr=yahoo"}, {"title": "Apple removes ICE tracking apps after pressure by Trump administration", "summary": "WASHINGTON (Reuters) -Apple said on Thursday that it had removed ICEBlock and other similar ICE-tracking apps from its App Store after it was contacted by President Donald Trump's administration, in a rare instance of apps being taken down due to a U.S. federal government demand.  Alphabet's Google also removed similar apps on Thursday for policy violations, but the company said it was not approached by the Justice Department before taking the action.  The app alerts users to Immigration and Customs Enforcement agents in their area, which the Justice Department says could increase the risk of assault on U.S. agents.", "description": "", "url": "https://ca.news.yahoo.com/apple-removes-ice-tracking-apps-195633493.html"}, {"title": "AAPL: Jefferies Downgrades Apple To 'Underperform' Citing Foldable iPhone Risks", "summary": "Jefferies Turns Bearish On Apple, Questions Demand For $2K Foldable iPhone", "description": "", "url": "https://finance.yahoo.com/news/aapl-jefferies-downgrades-apple-underperform-191710055.html"}]